УТ_для_edt.РасширениеСмарт/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЗаказНаПеремещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляПоступленияГрузов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="39299529-e597-4f8e-a8bf-4eb5dc180cbb">
    <name>ВыборГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff476f7c-83dd-4bf3-b877-ee64c1fc2c1c">
    <name>ИспользоватьАдресноеХранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6058b2d6-0f5a-4298-8e5c-da1204a63027">
    <name>смартПриоритетДляСпособаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ смарт:ММ #006 144 05.12.2019
	НастроитьВидимостьДоступностьЭлементов();
	//-- смарт:ММ 05.12.2019
	
	//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи
	УстановитьВидимостьНомераЗаявкиНаГарантийныйРемонт();
	//-- #5734 смарт: Тимофеева 18.02.26 

КонецПроцедуры

//++ смарт:ММ #040 217 21.03.2020 - проверка рулонов
&НаКлиенте
Процедура смарт_ТоварыКоличествоУпаковокПриИзмененииПеред(Элемент)
	
	Строка = Элементы.Товары.ТекущиеДанные;
	
	Если смартОбщегоНазначения.НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура) Тогда		
		Если Не смартОбщегоНазначенияКлиент.ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка) Тогда 			
			ВывестиСообщениеОбОшибкеПользователю(Строка.НомерСтроки);
			Строка.КоличествоУпаковок = 0;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 21.03.2020

//++ смарт:ММ #040 217 21.03.2020 - проверка рулонов
&НаКлиенте
Процедура смарт_ТоварыХарактеристикаПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если смартОбщегоНазначения.НоменклатураВРулонахПоХарактеристикам(ТекущаяСтрока.Номенклатура) Тогда	
		ТекущаяСтрока.КоличествоУпаковок = 0;
		ТекущаяСтрока.Количество = 0;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 21.03.2020

&НаКлиенте
&Перед("ТоварыВыбор")
Процедура смарт_ТоварыВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	смартОбщегоНазначенияКлиент.смартПроверитьУстановитьДоступностьТоварыСерия(Элемент, Элементы.ТоварыСерия, Элементы.Товары.ТекущиеДанные);
	//--#1547 смарт: Лопато 22.03.2024
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
//++ #Б-5574 смарт: Фролов 03.02.2026 //Документ Перемещение товаров. Печатная форма ТОРГ13. Вывод себестоимости.
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	Документы.ТранспортнаяНакладная.СохранитьРеквизитыТОРГ12ПередЗаписью(ЭтаФорма);

	ЗапасыСервер.УстановитьПараметрПерезаполнитьВидыЗапасовПриРучномИзмененииВидовЗапасов(ЭтотОбъект, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	#Вставка
	//++ #Б-5574 смарт: Фролов 03.02.2026 //Документ Перемещение товаров. Печатная форма ТОРГ13. Вывод себестоимости.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТоварыИзДокумента
		|ИЗ
		|	&ТаблицаТоваров КАК ПеремещениеТоваровТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыИзДокумента.Номенклатура КАК Номенклатура,
		|	ТоварыИзДокумента.Характеристика КАК Характеристика,
		|	СУММА(СебестоимостьТоваровОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСОстаток) КАК СтоимостьБезНДСОстаток
		|ИЗ
		|	ТоварыИзДокумента КАК ТоварыИзДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(, ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК СебестоимостьТоваровОстатки
		|		ПО ТоварыИзДокумента.Номенклатура = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура
		|			И ТоварыИзДокумента.Характеристика = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика
		|ГДЕ
		|	СебестоимостьТоваровОстатки.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыИзДокумента.Номенклатура,
		|	ТоварыИзДокумента.Характеристика");
		
		ТаблицаТоваров = ТекущийОбъект.Товары.Выгрузить(, "Номенклатура, Характеристика");
		
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
		
		ТаблицаСебестоимости = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрТовары Из ТекущийОбъект.Товары Цикл
			
			Если СтрТовары.смартСебестоимостьЗаЕдиницу = 0 Тогда
				
				СтрокиТаблицаСебестоимости = ТаблицаСебестоимости.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", 
					СтрТовары.Номенклатура, СтрТовары.Характеристика));
					
				Если СтрокиТаблицаСебестоимости.Количество() > 0 Тогда
					
					СтрТовары.смартСебестоимостьЗаЕдиницу = ?(СтрокиТаблицаСебестоимости[0].КоличествоОстаток > 0, 
						СтрокиТаблицаСебестоимости[0].СтоимостьБезНДСОстаток / СтрокиТаблицаСебестоимости[0].КоличествоОстаток, 0)			
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;
	
	КонецЕсли;
	//-- #Б-5574 смарт: Фролов 03.02.2026
	#КонецВставки

КонецПроцедуры //-- #Б-5574 смарт: Фролов 03.02.2026

#КонецОбласти

#Область ДоработкиСмарт

//++ смарт:ММ #006 144 05.12.2019
Процедура НастроитьВидимостьДоступностьЭлементов()
	
	смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(ЭтаФорма);	
	
КонецПроцедуры //-- смарт:ММ 05.12.2019

//++ смарт:ММ #040 217 21.03.2020 - проверка рулонов
&НаКлиенте
Процедура ВывестиСообщениеОбОшибкеПользователю(НомерСтроки);	
	ТекстСообщения = "Строка №" + НомерСтроки + Символы.ПС
								+ "Количество погонных метров должно быть кратно намотке рулона!" + Символы.ПС
								+ "Укажите другое количество погонных метров.";
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Товары["+(НомерСтроки-1)+"].КоличествоУпаковок"); 	
КонецПроцедуры //-- смарт:ММ 21.03.2020

//++#1517 смарт: Лопато 20.12.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерий()

	ЗаполнитьУстановитьВидимостьСерийДоступностьПерезаполнитьПоОтгрузке();
	
КонецПроцедуры //--#1517 смарт: Лопато 20.12.2023	

//++#1800 смарт: Лопато 03.05.2024 //Доработка перемещение товара (продолжение 1775) серийный учет чернил  
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерийТовары()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;

	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		
	ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(ТекущаяСтрокаИдентификатор, КэшированныеЗначения);	
	
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элементы.Товары, КэшированныеЗначения, ПараметрыУказанияСерий);

КонецПроцедуры //--#1800 смарт: Лопато 03.05.2024					

//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи

&НаСервере
Процедура УстановитьВидимостьНомераЗаявкиНаГарантийныйРемонт()	
	Если НЕ Элементы.Найти("ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка") = Неопределено Тогда  
		СкладДляЗапчастейПодЗаказ = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("ОсновнойСкладДляЗапчастейПодЗаказ", Ложь);
	    Элементы["ТоварысмартНомерЗаявкиНаГарантийныйРемонтСсылка"].Видимость = Объект.СкладОтправитель = СкладДляЗапчастейПодЗаказ
																				ИЛИ Объект.СкладПолучатель = СкладДляЗапчастейПодЗаказ
																				ИЛИ НЕ Объект.Товары.Количество() = Объект.Товары.НайтиСтроки(
																					Новый Структура("смартНомерЗаявкиНаГарантийныйРемонтСсылка", 
																					Документы.смартЗаявкаНаГарантийныйРемонт.ПустаяСсылка())).Количество();	
	КонецЕсли;
КонецПроцедуры 

&НаСервере
&ИзменениеИКонтроль("СкладОтправительПриИзмененииСервер")
Процедура смарт_СкладОтправительПриИзмененииСервер(ОтвязатьВсеСтрокиОтЗаказа, ОчищатьСтроки, КэшированныеЗначения)

	УстановитьПривилегированныйРежим(Истина);

	ОрдернаяСхемаПриОтгрузке = СкладыСервер.ИспользоватьОрдернуюСхемуПриОтгрузке(Объект.СкладОтправитель, Объект.Дата);
	ЗаполнитьУстановитьВидимостьСерийДоступностьПерезаполнитьПоОтгрузке();

	Объект.ВидЦены = Справочники.Склады.УчетныйВидЦены(Объект.СкладОтправитель);

	СкладОтправитель = Объект.СкладОтправитель;

	ОчиститьТабличнуюЧастьТоварыПриИзмененииСклада(ОтвязатьВсеСтрокиОтЗаказа, ОчищатьСтроки, КэшированныеЗначения);
    #Вставка
	//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи
	УстановитьВидимостьНомераЗаявкиНаГарантийныйРемонт(); 
	//-- #5734 смарт: Тимофеева 18.02.26 
	#КонецВставки
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СкладПолучательПриИзмененииСервер")
Процедура смарт_СкладПолучательПриИзмененииСервер(ОтвязатьВсеСтрокиОтЗаказа, ОчищатьСтроки, КэшированныеЗначения)

	ЗаполнитьУстановитьВидимостьСерийДоступностьПерезаполнитьПоОтгрузке();

	СкладПолучатель = Объект.СкладПолучатель;

	ОчиститьТабличнуюЧастьТоварыПриИзмененииСклада(ОтвязатьВсеСтрокиОтЗаказа, ОчищатьСтроки, КэшированныеЗначения);

	ЗаполнитьУстановитьРеквизитыДоставкиСервер("СкладПолучатель");

	АктуализироватьПеремещениеПодДеятельность();
    #Вставка
	//++ #5734 смарт: Тимофеева 18.02.26 / Создать роль для создания перемещений со склада Гарантийные запчасти - не для продажи
	УстановитьВидимостьНомераЗаявкиНаГарантийныйРемонт(); 
	//-- #5734 смарт: Тимофеева 18.02.26 
	#КонецВставки

КонецПроцедуры   
//-- #5734 смарт: Тимофеева 18.02.26 

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриИзменении")
Процедура смарт_ТоварыПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если Объект.ПеремещениеПоЗаказам 
		И ТекущаяСтрока <> Неопределено Тогда 
		ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.ПеремещениеПоЗаказам);

		ОбновитьЗависимыеРеквизитыФормыПоЗаказу(
		Объект.Товары,
		НадписьРасхождениеЗаказ,
		Элементы);
	КонецЕсли;

	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	ОповеститьОПроведенииДокумента(ПараметрыЗаписи);

	Если ЗначениеЗаполнено(ИзмененныеРеквизитыТОРГ12Строка) Тогда
		Если СтрНайти(ИзмененныеРеквизитыТОРГ12СтрокаСинонимов, ",") <> 0 Тогда  
			ТекстВопроса = НСтр("ru = 'Реквизиты %ИзмененныеРеквизиты% были изменены. Изменить их значения в транспортных накладных, в которых числится текущий документ?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Реквизит %ИзмененныеРеквизиты% был изменен. Изменить его значение в транспортных накладных, в которых числится текущий документ?'");
		КонецЕсли;
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ИзмененныеРеквизиты%", ИзмененныеРеквизитыТОРГ12СтрокаСинонимов);
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Изменить'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Не изменять'"));

		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект, Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи)), 
		ТекстВопроса, СписокКнопок);
		Возврат;
	КонецЕсли;

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ОповеститьОбИзмененииТекущихДелПоЭДО();

	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	СобытияФормКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Перем ВыполняемаяОперация;

	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
	"Документ.ПеремещениеТоваров.ФормаДокумента.Событие.ОбработкаВыбора");

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ВыполняемаяОперация", ВыполняемаяОперация) Тогда

		Если ВРег(ВыполняемаяОперация) = ВРег("ПодборТоваровИзЗаказа") Тогда

			ОбработкаПодбораТоваровИзЗаказа(ВыбранноеЗначение.АдресВХранилище);

		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РеквизитыПечатиРеализации" Тогда

		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ВидыЗапасов.Форма.ФормаВводаВидовЗапасов" Тогда	

		ПолучитьВидыЗапасовИзХранилища(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда

		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();

	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда

		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ТранспортнаяНакладная.Форма.ФормаВыбора" Тогда

		ДанныеТранспортныхНакладных = ОбработкаВыбораТранспортнойНакладной(ВыбранноеЗначение);
		ОбновитьИнформациюТранспортныхНакладных(ДанныеТранспортныхНакладных, ЭтаФорма);

	КонецЕсли;
	
	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки

КонецПроцедуры

#КонецОбласти
